Revit 2026 API

# EnergyAnalysisSurfaceCADObjectUniqueId Property

---

The unique id of the originating CAD object (model element) associated with this surface.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CADObjectUniqueId { get; }
```
```vb
Public ReadOnly Property CADObjectUniqueId As String
	Get
```
```cpp
public:
property String^ CADObjectUniqueId {
	String^ get ();
}
```
```fsharp
member CADObjectUniqueId : string with get
```

#### Property Value

String

This id can be passed to obtain the element from Document.Element[string] property, but any element obtained through this method may no longer be a valid or up-to-date model element. The originating CAD object is only accurate and up-to-date at the time of creation of the energy model. If the originating element belongs to a linked document, the unique id of the link obtained from CADLinkUniqueId should be used to access it.

#### Reference

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace